Tekla Open API Reference for Tekla Structures 2025
PartAttributes Constructor
Overload List
Name | Description
Part.PartAttributes()
 Creates a new default part attributes instance that loads standard attributes.
Part.PartAttributes(String)
 Creates a new part attributes instance that loads the specified attributes.
Top
See Also
Reference
Part.PartAttributes Class
Tekla.Structures.Drawing Namespace